//
//  PickerManager.swift
//  GetOutfit
//
//  Created by Алёна Максимова on 02.04.2022.
//

import Foundation

struct PickerManager {
    let gender = ["Женский", "Мужской", "Другой"]
    
    let shirtSizes = ["Размер кофт" ,"XXS", "XS", "S", "M", "L", "XL"]
    let pantsSize = ["Размер брюк", "XS", "S", "M", "L", "XL"]
    let shoeSizes = ["Размер обуви", "36", "36.5", "37", "37.5", "38", "38.5", "39", "39.5", "40"]
    
    let style = ["Стиль", "Официальный", "Повседневный", "Спортивный", "Праздничный", "Неформальный"]
    let color = ["Цветовая гамма", "Серый монохром", "Бежевый монохром", "Пастельная", "Мягкая", "Тёмная", "Яркая"]
    let budget = ["Средняя ценовая категория вещи", "До 50 000₽", "50 000 - 100 000₽", "Больше 100 000₽"]
    let clothesGender = ["Женская одежда", "Мужская одежда", "Унисекс"]
}
